Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: Finally, we can press ``Enter`` on a leaf node and select the ``Zoom into DSO`` menu item to show only entries associated with a specific DSO. In the screenshot below, we've zoomed into the ``libc`` DSO which shows all the entries associated with the ``libc-xxx.so`` DSO.
it_it: Infine, possiamo premere ``Enter`` su un nodo foglia e selezionare la voce di menu ``Zoom into DSO`` per visualizzare solo le voci associate a uno specifico DSO. Nella schermata seguente, abbiamo ingrandito il DSO ``libc``, che mostra tutte le voci associate al DSO ``libc-xxx.so``.

source: Finally, we can see that now that the BusyBox debugging information is installed, the previously unresolved symbol in the ``sys_clock_gettime()`` entry mentioned previously is now resolved, and shows that the ``sys_clock_gettime`` system call that was the source of 6.75% of the ``copy-to-user`` overhead was initiated by the ``handle_input()`` BusyBox function:
it_it: Infine, possiamo vedere che ora che le informazioni di debug di BusyBox sono installate, il simbolo precedentemente non risolto nella voce "sys_clock_gettime()" menzionata in precedenza è ora risolto e mostra che la chiamata di sistema ``sys_clock_gettime``, che era la fonte del 6,75% dell'overhead di ``copy-to-user``, è stata avviata dalla funzione BusyBox ``handle_input()``:

source: Finding a Suitable Mailing List
it_it: Trovare una Mailing List Adatta

source: First we need to get an updated version of the CVE information from the `CVE Project`. Run it as follows:
it_it: Prima dobbiamo ottenere una versione aggiornata delle informazioni CVE dal `CVE Project`. Eseguirlo in questo modo:

source: First, clone the layer next to the other layers::
it_it: Innanzitutto, clonare il layer accanto agli altri layer::

source: First, create the pull request. For example, the following command runs the script, specifies the upstream repository in the contrib directory into which you pushed the change, and provides a subject line in the created patch files::
it_it: Innanzitutto, si crea la pull request. Ad esempio, il seguente comando esegue lo script, specifica il repository upstream nella directory contrib in cui si è effettuato il push della modifica e fornisce un oggetto nei file patch creati::

source: First, from the host, connect to the target through SSH::
it_it: Innanzitutto, dall'host, ci si connette al target tramite SSH::

source: First, remove temporary outputs (:term:`TMPDIR`) from the previous builds, to make the :term:`OpenEmbedded Build System` rebuild everything using the shared state:
it_it: Innanzitutto, rimuoviamo gli output temporanei (:term:`TMPDIR`) dalle build precedenti, in modo che :term:`OpenEmbedded Build System` ricompili tutto utilizzando lo shared state:

source: Fixes for bugs
it_it: Correzioni di bug

source: Fixes so the codebase works with newly released distros, e.g. :ref:`ref-classes-uninative` tarball updates or build fixes for a new GCC version on the :term:`Build Host`.
it_it: Correzioni per rendere il codice sorgente compatibile con le distribuzioni appena rilasciate, ad esempio aggiornamenti del tarball :ref:`ref-classes-uninative` o correzioni di compilazione per una nuova versione di GCC sul :term:`Build Host`.

source: Fixing CVE product name and version mappings
it_it: Correzione delle mappature tra nome prodotto e versione CVE

source: Fixing vulnerabilities in recipes
it_it: Correzione delle vulnerabilità nelle ricette

source: Fixing your From identity
it_it: Correzione dell'Identità del Mittente

source: Follow these steps to add a :ref:`BSP layer <overview-manual/concepts:bsp layer>`:
it_it: Seguire questi passaggi per aggiungere un :ref:`layer BSP <overview-manual/concepts:bsp layer>`:

source: Follow this procedure to push a change to an upstream "contrib" Git repository once the steps in ":ref:`contributor-guide/submit-changes:preparing changes for submission`" have been followed:
it_it: Seguire questa procedura per inviare una modifica a un repository Git "contrib" upstream dopo aver seguito i passaggi descritti in ":ref:`contributor-guide/submit-changes:preparing changes for submission`":

source: For Fedora and RedHat use::
it_it: Per Fedora e Red Hat si usa::

source: For LTTng user space tracing, you need to have a properly instrumented user space program. For this example, we'll use the ``hello`` test program generated by the ``lttng-ust`` build.
it_it: Per tracciare lo spazio utente con LTTng, è necessario disporre di un programma nello spazio utente opportunamente strumentato [instrumented]. In questo esempio, useremo il programma di test ``hello`` generato dalla build ``lttng-ust``.

source: For a detailed description of this particular layer configuration file, see ":ref:`step 3 <dev-manual/layers:creating your own layer>`" in the discussion that describes how to create layers in the Yocto Project Development Tasks Manual.
it_it: Per una descrizione dettagliata di questo specifico file di configurazione del layer, consultare il ":ref:`passaggio 3 <dev-manual/layers:creating your own layer>`" nella sezione che descrive come creare layer nel Manuale di Sviluppo dei Task di Yocto Project.

source: For a general flow of the build procedures, see the ":ref:`dev-manual/building:building a simple image`" section in the Yocto Project Development Tasks Manual.
it_it: Per una descrizione generale delle procedure di compilazione, consultare la sezione ":ref:`dev-manual/building:building a simple image`" nel Manuale di Sviluppo dei Task di Yocto Project.

source: For a list of example images that the Yocto Project provides, see the ":doc:`/ref-manual/images`" chapter in the Yocto Project Reference Manual.
it_it: Per un elenco di immagini di esempio fornite da Yocto Project, consultare il capitolo ":doc:`/ref-manual/images`" nel Manuale di Riferimento di Yocto Project.

source: For a very detailed look at this workflow, see the ":ref:`overview-manual/concepts:openembedded build system concepts`" section.
it_it: Per una descrizione dettagliata di questo flusso di lavoro, consultare la sezione ":ref:`overview-manual/concepts:openembedded build system concepts`".

source: For additional detail about the Yocto Project development environment, see the ":doc:`/overview-manual/development-environment`" chapter.
it_it: Per ulteriori dettagli sull'ambiente di sviluppo di Yocto Project, consultare il capitolo ":doc:`/overview-manual/development-environment`".

source: For an example that shows how to create a new layer using the tools, see the ":ref:`bsp-manual/bsp:creating a new bsp layer using the \`\`bitbake-layers\`\` script`" section.
it_it: Per un esempio che mostra come creare un nuovo layer utilizzando gli strumenti, consultare la sezione ":ref:`bsp-manual/bsp:creating a new bsp layer using the \`\`bitbake-layers\`\` script`".

source: For an overview of Toaster, see this `introduction video <https://youtu.be/BlXdOYLgPxA>`__.
it_it: Per una panoramica di Toaster, guardare questo `video introduttivo <https://youtu.be/BlXdOYLgPxA>`__.

source: For any supported release of Yocto Project, you can also go to the :yocto_home:`Yocto Project Website <>` and select the "Releases" item from the "Development" menu and get a released tarball of the repositories, any supported BSP tarball, or Yocto Project tools. Unpacking these tarballs gives you a snapshot of the released files.
it_it: Per qualsiasi versione supportata di Yocto Project, è anche possibile visitare il sito web di Yocto Project all'indirizzo :yocto_home:`Sito Web di Yocto Project <>` e selezionare la voce "Releases" dal menù "Development" per scaricare un tarball dei repository, un tarball BSP supportato o gli strumenti di Yocto Project. L'estrazione di questi archivi tar fornisce un'istantanea dei file rilasciati.

source: For background information on cross-development toolchains in the Yocto Project development environment, see the ":ref:`overview-manual/concepts:cross-development toolchain generation`" section.
it_it: Per informazioni di base sulle toolchain cross-development nell'ambiente di sviluppo di Yocto Project, consultare la sezione ":ref:`overview-manual/concepts:cross-development toolchain generation`".

source: For booting faster. As the root filesystem is extracted into RAM, accessing the first user-space applications is very fast, compared to having to initialize a block device, to access multiple blocks from it, and to go through a filesystem having its own overhead. For example, this allows to display a splashscreen very early, and to later take care of mounting the final root filesystem and loading less time-critical kernel drivers.
it_it: Per un avvio più rapido. Poiché il filesystem root viene estratto nella RAM, l'accesso alle prime applicazioni nello spazio utente è molto più veloce rispetto all'inizializzazione di un dispositivo a blocchi, all'accesso a più blocchi da esso e all'attraversamento di un filesystem con il suo overhead. Ad esempio, questo permette di visualizzare una schermata iniziale molto presto e di occuparsi successivamente del montaggio del filesystem root finale e del caricamento dei driver del kernel meno critici in termini di tempo.

source: For booting the same kernel binary on multiple systems requiring different device drivers. The :term:`Initramfs` image is then customized for each type of system, to include the specific kernel modules necessary to access the final root filesystem. This technique is used on all GNU / Linux distributions for desktops and servers.
it_it: Per avviare lo stesso binario del kernel su più sistemi che richiedono "device driver" differenti. L'immagine :term:`Initramfs` viene quindi personalizzata per ogni tipo di sistema, includendo i moduli del kernel specifici necessari per accedere al filesystem root finale. Questa tecnica è utilizzata in tutte le distribuzioni GNU/Linux per desktop e server.

source: For cases where you can substitute a free component and still maintain the system's functionality, the "DOWNLOADS" selection from the "SOFTWARE" tab on the :yocto_home:`Yocto Project Website <>` makes available de-featured BSPs that are completely free of any IP encumbrances. For these cases, you can use the substitution directly and without any further licensing requirements. If present, these fully de-featured BSPs are named appropriately different as compared to the names of their respective encumbered BSPs. If available, these substitutions are your simplest and most preferred options. Obviously, use of these substitutions assumes the resulting functionality meets system requirements.
it_it: Nei casi in cui è possibile sostituire un componente con uno libero mantenendo la funzionalità del sistema, la sezione "DOWNLOADS" nella scheda "SOFTWARE" del :yocto_home:`Sito Web di Yocto Project <>`, mette a disposizione file BSP privi di funzionalità e completamente esenti da vincoli di proprietà intellettuale. In questi casi, è possibile utilizzare direttamente la sostituzione senza ulteriori requisiti di licenza. Se presenti, questi file BSP privi di funzionalità hanno nomi diversi rispetto ai rispettivi file BSP con licenza. Se disponibili, queste sostituzioni rappresentano l'opzione più semplice e preferibile. Ovviamente, l'utilizzo di queste sostituzioni presuppone che la funzionalità risultante soddisfi i requisiti di sistema.

source: For changes in a recipe:
it_it: Per modifiche a una ricetta:

source: For changes relating to the SDK:
it_it: Per modifiche relative all'SDK:

source: For changes that affect the build environment:
it_it: Per modifiche che interessano l'ambiente di build:

source: For details on how to view information about a task's signature, see the ":ref:`dev-manual/debugging:viewing task variable dependencies`" section in the Yocto Project Development Tasks Manual.
it_it: Per informazioni dettagliate su come visualizzare le informazioni sulla firma di un task, consultare la sezione ":ref:`dev-manual/debugging:viewing task variable dependencies`" Yocto Project Development Tasks Manual.

source: For details, see Wikipedia's :wikipedia:`SPDX page <Software_Package_Data_Exchange>` and the ":ref:`dev-manual/sbom:creating a software bill of materials`" section of the Development Tasks manual.
it_it: Per maggiori dettagli, consultare la pagina :wikipedia:`SPDX page <Software_Package_Data_Exchange>` di Wikipedia e la sezione ":ref:`dev-manual/sbom:creating a software bill of materials`" del Manuale di Sviluppo dei Task.

source: For each contributions you make, you should test your changes as well. For this the Yocto Project offers several types of tests. Those tests cover different areas and it depends on your changes which are feasible. For example run:
it_it: Per ogni contributo che apporti, si devono anche testare le modifiche. A tal fine, Yocto Project offre diversi tipi di test. Questi test coprono aree diverse e la loro fattibilità dipende dalle modifiche che apportata. Ad esempio, eseguire:

source: For each layer, you might also look for specific instructions (if any) for reporting potential security issues in the specific ``SECURITY.md`` file at the root of the repository. Instructions on how and where submit a patch are usually available in ``README.md``. If this is your first patch to the Yocto Project/OpenEmbedded, you might want to have a look into the Contributor's Manual section ":ref:`contributor-guide/submit-changes:preparing changes for submission`".
it_it: Per ogni layer, si possono anche cercare istruzioni specifiche (se presenti) per la segnalazione di potenziali problemi di sicurezza nel file ``SECURITY.md`` nella directory principale del repository. Le istruzioni su come e dove inviare una patch sono generalmente disponibili nel file ``README.md``. Se questa è la prima patch per Yocto Project/OpenEmbedded, si dovrebbe consultare la sezione ":ref:`contributor-guide/submit-changes:preparing changes for submission`".

source: For each software component, a list of CVEs which are possibly impacting this version
it_it: Per ogni componente software, un elenco di CVE che potrebbero avere un impatto su questa versione

source: For each task that completes successfully, BitBake writes a stamp file into the :term:`STAMPS_DIR` directory. The beginning of the stamp file's filename is determined by the :term:`STAMP` variable, and the end of the name consists of the task's name and current :ref:`input checksum <overview-manual/concepts:checksums (signatures)>`.
it_it: Per ogni task completata con successo, BitBake scrive un file di "stamp" (timbro) nella directory :term:`STAMPS_DIR`. L'inizio del nome del file di timbro è determinato dalla variabile :term:`STAMP`, mentre la fine del nome è composta dal nome del task e dal :ref:`checksum di input <overview-manual/concepts:checksums (signatures)>` corrente.

source: For efficiency, the OpenEmbedded build system creates and uses this directory to hold recipes that share a work directory with other recipes. This is for example used for ``gcc`` and its variants (e.g. ``gcc-cross``, ``libgcc``, ``gcc-runtime``, and so forth), or by the :ref:`ref-classes-kernel` class to make the kernel source code and kernel build artifacts available to out-of-tree kernel modules or other kernel-dependent recipes.
it_it: Per motivi di efficienza, il sistema di build OpenEmbedded crea e utilizza questa directory per contenere le ricette che condividono una directory di lavoro con altre ricette. Viene utilizzata, ad esempio, per ``gcc`` e le sue varianti (ad esempio ``gcc-cross``, ``libgcc``, ``gcc-runtime`` e così via), oppure dalla classe :ref:`ref-classes-kernel` per rendere il codice sorgente del kernel e gli artefatti di compilazione del kernel disponibili ai moduli del kernel esterni all'albero o ad altre ricette dipendenti dal kernel.

source: For every local file (e.g. ``file://``) that is part of a recipe's :term:`SRC_URI` statement, the OpenEmbedded build system takes a checksum of the file for the recipe and inserts the checksum into the signature for the :ref:`ref-tasks-fetch` task. If any local file has been modified, the :ref:`ref-tasks-fetch` task and all tasks that depend on it are re-executed.
it_it: Per ogni file locale (ad esempio ``file://``) che fa parte dell'istruzione :term:`SRC_URI` di una ricetta, il sistema di build OpenEmbedded calcola il checksum del file per la ricetta e lo inserisce nella firma [signature] del task :ref:`ref-tasks-fetch`. Se un file locale è stato modificato, il task :ref:`ref-tasks-fetch` e tutti quelli che dipendono da esso vengono rieseguiti.

source: For example, Debian-based distributions provide it with the ``gpg`` package. Install it as follows:
it_it: Ad esempio, le distribuzioni basate su Debian lo forniscono tramite il pacchetto ``gpg``. Installarlo come segue:

source: For example, here is a properly formatted commit message::
it_it: Ad esempio, ecco un messaggio di commit formattato correttamente::

source: For example, if a recipe is currently at version ``1.4.2`` and the regex is ``^1\.4(\.\d+)*$``, then version ``1.4.7`` would be a valid upgrade candidate but ``1.5.0`` would not.
it_it: Ad esempio, se una ricetta è attualmente alla versione ``1.4.2`` e l'espressione regolare è ``^1\.4(\.\d+)*$``, la versione ``1.4.7`` sarebbe una valida candidata all'aggiornamento, mentre la versione ``1.5.0`` non lo sarebbe.

source: For example, if you were to examine the :oe_git:`tree view </openembedded-core/tree/>` of the ``openembedded-core`` repository, you will see several layers: ``meta``, ``meta-skeleton``, and ``meta-selftest``. Each of these repositories represents a distinct layer.
it_it: Ad esempio, se si esamina la :oe_git:`vista ad albero </openembedded-core/tree/>` del repository ``openembedded-core``, si vedranno diversi layer: ``meta``, ``meta-skeleton`` e ``meta-selftest``. Ciascuno di questi repository rappresenta un layer distinto.

source: For example, suppose you have permissions to push into the upstream ``meta-intel-contrib`` repository and you are working in a local branch named `your_name`\ ``/README``. The following command pushes your local commits to the ``meta-intel-contrib`` upstream repository and puts the commit in a branch named `your_name`\ ``/README``::
it_it: Ad esempio, supponiamo che si abbiano i permessi per eseguire il push nel repository upstream ``meta-intel-contrib`` e che si stia lavorando in un branch locale chiamato `your_name`\ ``/README``. Il seguente comando invia i propri commit locali al repository upstream ``meta-intel-contrib`` e li inserisce in un branch denominato `your_name`\ ``/README``::

source: For example, the :term:`OpenEmbedded-Core (OE-Core)` layer provides both the GPL-2.0-only and MIT license files, and a "LICENSE" file to explain how these two licenses are attributed to files found in the layer.
it_it: Ad esempio, il layer :term:`OpenEmbedded-Core (OE-Core)` fornisce sia i file di licenza GPL-2.0-only che MIT, oltre a un file "LICENSE" che spiega come queste due licenze vengono attribuite ai file presenti nel layer.

source: For example, the report for the ``glibc`` package looks like this (simplified):
it_it: Ad esempio, il report per il pacchetto ``glibc`` si presenta così (semplificato):

source: For example, this probe from the `SystemTap tutorial <https://sourceware.org/systemtap/tutorial.html>`__ just prints a line every time any process on the system runs ``open()`` on a file. For each line, it prints the executable name of the program that opened the file, along with its PID, and the name of the file it opened (or tried to open), which it extracts from the argument string (``argstr``) of the ``open`` system call.
it_it: Ad esempio, questa sonda del `tutorial di SystemTap <https://sourceware.org/systemtap/tutorial.html>`__ stampa una riga ogni volta che un processo sul sistema esegue ``open()`` su un file. Per ogni riga, stampa il nome eseguibile del programma che ha aperto il file, insieme al suo PID, e il nome del file aperto (o che ha tentato di aprire), che estrae dalla stringa degli argomenti (``argstr``) della chiamata di sistema ``open``.

source: For example, when you intend to add multiple new recipes, each recipe should be added in a separate commit. For upgrades to existing recipes, the previous version should usually be deleted as part of the same commit to add the upgraded version.
it_it: Ad esempio, quando si intende aggiungere più nuove ricette, ciascuna ricetta deve essere aggiunta in un commit separato. Per gli aggiornamenti di ricette esistenti, la versione precedente dovrebbe in genere essere eliminata come parte dello stesso commit per aggiungere la versione aggiornata.

source: For example::
it_it: Per esempio::

source: For general information on BSP layer structure, see the :doc:`/bsp-manual/index`.
it_it: Per informazioni generali sulla struttura dei layer BSP, consultare il :doc:`/bsp-manual/index`.

source: For general information on layers, see the ":ref:`overview-manual/yp-intro:the yocto project layer model`" section in the Yocto Project Overview and Concepts Manual. For information on how to create layers, see the ":ref:`dev-manual/layers:understanding and creating layers`" section in the Yocto Project Development Tasks Manual.
it_it: Per informazioni generali sui layer, consultare la sezione ":ref:`overview-manual/yp-intro:the yocto project layer model`" nella Manuale Introduttivo e Concetti di Yocto Project. Per informazioni su come creare layer, consultare la sezione ":ref:`dev-manual/layers:understanding and creating layers`" nel Manuale di Sviluppo dei Task di Yocto Project.

source: For help on using these scripts, simply provide the ``-h`` argument as follows::
it_it: Per ricevere assistenza sull'utilizzo di questi script, è sufficiente specificare l'argomento ``-h`` come segue::

source: For host package requirements on all supported Linux distributions, see the :ref:`ref-manual/system-requirements:required packages for the build host` section in the Yocto Project Reference Manual.
it_it: Per i requisiti dei pacchetti host su tutte le distribuzioni Linux supportate, consultare la sezione :ref:`ref-manual/system-requirements:required packages for the build host` nel Manuale di Riferimento di Yocto Project.

source: For idempotence when modifying files in tasks, it is usually best to:
it_it: Per garantire l'idempotenza durante la modifica dei file nelle attività, è generalmente consigliabile:

source: For information about and how to use Toaster, see the :doc:`/toaster-manual/index`.
it_it: Per informazioni su Toaster e sul suo utilizzo, consultare la documentazione :doc:`/toaster-manual/index`.

source: For information on LTTng in general, visit the `LTTng Project <https://lttng.org/lttng2.0>`__ site. You can find a "Getting Started" link on this site that takes you to an LTTng Quick Start.
it_it: Per informazioni generali su LTTng, visitare il sito di `LTTng Project <https://lttng.org/lttng2.0>`__. Su questo sito è presente un link "Getting Started" che rimanda a una Guida Rapida di LTTng.

source: For information on advantages gained when building a cross-development toolchain installer, see the ":ref:`sdk-manual/appendix-obtain:building an sdk installer`" appendix in the Yocto Project Application Development and the Extensible Software Development Kit (eSDK) manual.
it_it: Per informazioni sui vantaggi derivanti dalla creazione di un programma di installazione di una toolchain di cross-sviluppo, consultare l'appendice ":ref:`sdk-manual/appendix-obtain:building an sdk installer`" nel Manuale di Sviluppo di Applicazioni Yocto Project e Software Development Kit (eSDK).
